<a href="https://colab.research.google.com/github/mcupk/CSV/blob/main/csv.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [2]:
%cd drive/My Drive/Colab Notebooks/Dataset/tarball-lite/AFAD-Lite/

/content/drive/My Drive/Colab Notebooks/Dataset/tarball-lite/AFAD-Lite

In [ ]:
import os 
from glob import glob
import csv

In [ ]:
PATH = '/content/drive/My Drive/Colab Notebooks/Dataset/tarball-lite/AFAD-Lite'
EXT = "*.jpg"

All_jpg_files = []
for path, subdir, files in os.walk(PATH):
    for file in glob(os.path.join(path, EXT)):
        All_jpg_files.append(file)

In [ ]:
import numpy as np
import pandas as pd
import os,sys
import csv
import glob
import os.path

data_path="/content/drive/My Drive/Colab Notebooks/Dataset/tarball-lite/AFAD-Lite"
with open('dataset_New_1.csv', 'w', newline='') as f:
        fieldnames = ['file_name', 'age']
        thewriter = csv.DictWriter(f, fieldnames=fieldnames)
        thewriter.writeheader()
        for path, dirs, files in os.walk(data_path):
            for i in files:
                n = os.path.join(path,i)
                x = n.split(os.sep)
                thewriter.writerow({'file_name': n, 'age':x[8]})

In [ ]:
%cd drive/My Drive/Colab Notebooks/

/content/drive/My Drive/Colab Notebooks

In [3]:
import pandas as pd

df1 = pd.read_csv('dataset_New_1.csv')
df1

                                               file_name                age
0      /content/drive/My Drive/Colab Notebooks/Datase...  dataset_New_1.csv
1      /content/drive/My Drive/Colab Notebooks/Datase...                 18
2      /content/drive/My Drive/Colab Notebooks/Datase...                 18
3      /content/drive/My Drive/Colab Notebooks/Datase...                 18
4      /content/drive/My Drive/Colab Notebooks/Datase...                 18
...                                                  ...                ...
57542  /content/drive/My Drive/Colab Notebooks/Datase...                 28
57543  /content/drive/My Drive/Colab Notebooks/Datase...                 28
57544  /content/drive/My Drive/Colab Notebooks/Datase...                 28
57545  /content/drive/My Drive/Colab Notebooks/Datase...                 28
57546  /content/drive/My Drive/Colab Notebooks/Datase...                 28

[57547 rows x 2 columns]

In [5]:
df2 = df1.drop(df1.index[0])
df2

                                               file_name age
1      /content/drive/My Drive/Colab Notebooks/Datase...  18
2      /content/drive/My Drive/Colab Notebooks/Datase...  18
3      /content/drive/My Drive/Colab Notebooks/Datase...  18
4      /content/drive/My Drive/Colab Notebooks/Datase...  18
5      /content/drive/My Drive/Colab Notebooks/Datase...  18
...                                                  ...  ..
57542  /content/drive/My Drive/Colab Notebooks/Datase...  28
57543  /content/drive/My Drive/Colab Notebooks/Datase...  28
57544  /content/drive/My Drive/Colab Notebooks/Datase...  28
57545  /content/drive/My Drive/Colab Notebooks/Datase...  28
57546  /content/drive/My Drive/Colab Notebooks/Datase...  28

[57546 rows x 2 columns]

In [ ]:
cat_data = df2[['file_name']]
num_data = df2[['age']]

In [ ]:
cat_data.head()

                                           file_name
1  /content/drive/My Drive/Colab Notebooks/Datase...
2  /content/drive/My Drive/Colab Notebooks/Datase...
3  /content/drive/My Drive/Colab Notebooks/Datase...
4  /content/drive/My Drive/Colab Notebooks/Datase...
5  /content/drive/My Drive/Colab Notebooks/Datase...

In [ ]:
num_data.head()

  age
1  18
2  18
3  18
4  18
5  18

In [ ]:
for col in df2.columns:
  print(col,':', len(df[col].unique()),'labels')

file_name : 57546 labels
age : 21 labels

In [ ]:
df2.age.value_counts().sort_values(ascending=False).head(21)

20    5486
19    5463
21    5015
22    4739
24    4091
23    3894
25    3353
18    3048
26    2624
27    2150
28    1868
29    1810
30    1804
33    1706
32    1626
34    1578
35    1553
36    1478
38    1440
37    1421
39    1399
Name: age, dtype: int64

In [ ]:
top = [x for x in df2.age.value_counts().sort_values(ascending=False).index]
top

['20',
 '19',
 '21',
 '22',
 '24',
 '23',
 '25',
 '18',
 '26',
 '27',
 '28',
 '29',
 '30',
 '33',
 '32',
 '34',
 '35',
 '36',
 '38',
 '37',
 '39']

In [ ]:
import numpy as np

In [ ]:
for label in top:
  df2[label] = np.where(df2['age']==label, 1, 0)

df3 = df2[['age']+top]

In [ ]:
df3

      age  20  19  21  22  24  23  25  18  ...  30  33  32  34  35  36  38  37  39
1      18   0   0   0   0   0   0   0   1  ...   0   0   0   0   0   0   0   0   0
2      18   0   0   0   0   0   0   0   1  ...   0   0   0   0   0   0   0   0   0
3      18   0   0   0   0   0   0   0   1  ...   0   0   0   0   0   0   0   0   0
4      18   0   0   0   0   0   0   0   1  ...   0   0   0   0   0   0   0   0   0
5      18   0   0   0   0   0   0   0   1  ...   0   0   0   0   0   0   0   0   0
...    ..  ..  ..  ..  ..  ..  ..  ..  ..  ...  ..  ..  ..  ..  ..  ..  ..  ..  ..
57542  28   0   0   0   0   0   0   0   0  ...   0   0   0   0   0   0   0   0   0
57543  28   0   0   0   0   0   0   0   0  ...   0   0   0   0   0   0   0   0   0
57544  28   0   0   0   0   0   0   0   0  ...   0   0   0   0   0   0   0   0   0
57545  28   0   0   0   0   0   0   0   0  ...   0   0   0   0   0   0   0   0   0
57546  28   0   0   0   0   0   0   0   0  ...   0   0   0   0   0   0   0   0   0

[57546 rows x 22 columns]

In [ ]:
df = df3.drop(columns=['age'])
df.head()

   20  19  21  22  24  23  25  18  26  ...  30  33  32  34  35  36  38  37  39
1   0   0   0   0   0   0   0   1   0  ...   0   0   0   0   0   0   0   0   0
2   0   0   0   0   0   0   0   1   0  ...   0   0   0   0   0   0   0   0   0
3   0   0   0   0   0   0   0   1   0  ...   0   0   0   0   0   0   0   0   0
4   0   0   0   0   0   0   0   1   0  ...   0   0   0   0   0   0   0   0   0
5   0   0   0   0   0   0   0   1   0  ...   0   0   0   0   0   0   0   0   0

[5 rows x 21 columns]

In [ ]:
dataset = pd.concat([cat_data, df],axis=1)
dataset.head()

                                           file_name  20  19  ...  38  37  39
1  /content/drive/My Drive/Colab Notebooks/Datase...   0   0  ...   0   0   0
2  /content/drive/My Drive/Colab Notebooks/Datase...   0   0  ...   0   0   0
3  /content/drive/My Drive/Colab Notebooks/Datase...   0   0  ...   0   0   0
4  /content/drive/My Drive/Colab Notebooks/Datase...   0   0  ...   0   0   0
5  /content/drive/My Drive/Colab Notebooks/Datase...   0   0  ...   0   0   0

[5 rows x 22 columns]

In [ ]:
def f(row):
    if row['age'] == 18:
        val = 1
    elif row['age']  row['B']:
        val = 1
    else:
        val = -1
    return val

In [ ]:
dataset.to_csv('New_train_2.csv')

In [ ]:
def Age():
  a = 18
  b = 19
  while df['age']<=39:
    df,
    age += 1,

In [33]:
labels = []
a = 18
y = 19
w =1
z = 1
for x in df2["age"]:
  int(x)
  labels.append(z)
  z += 1
  x += 2
  # for y in df2["age"]:
  #   labels.append(w)
  #   w += 1
  #   y += 2


  

  # while x <=39:
  #   labels.append(z)
  #   z += 1
  #   x += 2

labels
# df2["labels"] = labels
# print(df2)

SyntaxError: ignored

In [ ]:
labels = []

for x, y in df2["age"]:
  x = 18
  y = 19
  z = 1
  b = 1
  while x <=39:
    labels.append(z)
    z += 1
    x += 2
  while y<=39:
    print(y)
    labels.append(b)
    b += 1
    y += 2

labels
# df2["labels"] = labels
# print(df2)

In [13]:
import pandas as pd

df3 = pd.DataFrame(df2)
df3

                                               file_name age
1      /content/drive/My Drive/Colab Notebooks/Datase...  18
2      /content/drive/My Drive/Colab Notebooks/Datase...  18
3      /content/drive/My Drive/Colab Notebooks/Datase...  18
4      /content/drive/My Drive/Colab Notebooks/Datase...  18
5      /content/drive/My Drive/Colab Notebooks/Datase...  18
...                                                  ...  ..
57542  /content/drive/My Drive/Colab Notebooks/Datase...  28
57543  /content/drive/My Drive/Colab Notebooks/Datase...  28
57544  /content/drive/My Drive/Colab Notebooks/Datase...  28
57545  /content/drive/My Drive/Colab Notebooks/Datase...  28
57546  /content/drive/My Drive/Colab Notebooks/Datase...  28

[57546 rows x 2 columns]

In [21]:
df4 = pd.DataFrame(columns=['labels'])
df4['labels'] = labels

In [22]:
df4

         labels
0             1
1             2
2             3
3             4
4             5
...         ...
1266007       7
1266008       8
1266009       9
1266010      10
1266011      11

[1266012 rows x 1 columns]

In [21]:
y = [18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39]
y = 19
a = 18
x = []
t = []
z = 1
b = 1
while a <=39:
  x.append(z)
  print(a)
  z += 1
  a += 2
while y<=39:
  print(y)
  t.append(b)
  b += 1
  y += 2

# print(a)
print(t)
# print(y)
print(x)

18
20
22
24
26
28
30
32
34
36
38
19
21
23
25
27
29
31
33
35
37
39
[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11]
[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11]

In [11]:
y = [18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39]
y = 39
while y-2 >=39:
  print(y)
  y = y-2

print(y)

39